{
  "class_name": "Sequential",
  "config": [
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_1",
        "trainable": true,
        "batch_input_shape": [
          null,
          200,
          200,
          14
        ],
        "dtype": "float32",
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_1",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_1",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_2",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_2",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_2",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_1",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_3",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_3",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_3",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_4",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_4",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_4",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_2",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_5",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_5",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_5",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_6",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_6",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_6",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_7",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_7",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_7",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_3",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_8",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_8",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_8",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_9",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_9",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_9",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_10",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_10",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_10",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_4",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_11",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_11",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_11",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_12",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_12",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_12",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_13",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_13",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_13",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "MaxPooling2D",
      "config": {
        "name": "max_pooling2d_5",
        "trainable": true,
        "pool_size": [
          2,
          2
        ],
        "padding": "valid",
        "strides": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_1",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_14",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_14",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_14",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_15",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_15",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_15",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_16",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_16",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_16",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_2",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_17",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_17",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_17",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_18",
        "trainable": true,
        "filters": 512,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_18",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_18",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_19",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_19",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_19",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_3",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "ZeroPadding2D",
      "config": {
        "name": "zero_padding2d_1",
        "trainable": true,
        "padding": [
          [
            1,
            1
          ],
          [
            1,
            1
          ]
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_20",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_20",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_20",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_21",
        "trainable": true,
        "filters": 256,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_21",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_21",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_22",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_22",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_22",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_4",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_23",
        "trainable": true,
        "filters": 128,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_23",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_23",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_24",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
        "padding": "same",
        "data_format": "channels_last",
        "dilation_rate": [
          1,
          1
        ],
        "activation": "linear",
        "use_bias": true,
        "kernel_initializer": {
          "class_name": "VarianceScaling",
          "config": {
            "scale": 1.0,
            "mode": "fan_avg",
            "distribution": "uniform",
            "seed": null
          }
        },
        "bias_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "kernel_regularizer": null,
        "bias_regularizer": null,
        "activity_regularizer": null,
        "kernel_constraint": null,
        "bias_constraint": null
      }
    },
    {
      "class_name": "BatchNormalization",
      "config": {
        "name": "batch_normalization_24",
        "trainable": true,
        "axis": -1,
        "momentum": 0.99,
        "epsilon": 0.001,
        "center": true,
        "scale": true,
        "beta_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "gamma_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "moving_mean_initializer": {
          "class_name": "Zeros",
          "config": {}
        },
        "moving_variance_initializer": {
          "class_name": "Ones",
          "config": {}
        },
        "beta_regularizer": null,
        "gamma_regularizer": null,
        "beta_constraint": null,
        "gamma_constraint": null
      }
    },
    {
      "class_name": "Activation",
      "config": {
        "name": "activation_24",
        "trainable": true,
        "activation": "relu"
      }
    },
    {
      "class_name": "UpSampling2D",
      "config": {
        "name": "up_sampling2d_5",
        "trainable": true,
        "size": [
          2,
          2
        ],
        "data_format": "channels_last"
      }
    },
    {
      "class_name": "Conv2D",
      "config": {
        "name": "conv2d_25",
        "trainable": true,
        "filters": 64,
        "kernel_size": [
          3,
          3
        ],
        "strides": [
          1,
          1
        ],
